// ignore_for_file: prefer_const_constructors_in_immutables, prefer_const_literals_to_create_immutables, prefer_const_constructors

import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:seed/components/bottom_menu.dart';
import 'package:seed/components/color.dart';
import 'package:seed/components/font_format.dart';

class PrivacyPolicy extends StatefulWidget {
  PrivacyPolicy({Key? key}) : super(key: key);

  @override
  State<PrivacyPolicy> createState() => _PrivacyPolicyState();
}

class _PrivacyPolicyState extends State<PrivacyPolicy> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      resizeToAvoidBottomInset: false,
      backgroundColor: bgGreyColor,
      appBar: AppBar(
        backgroundColor: whiteColor,
        shadowColor: bgGreyColor.withOpacity(0.5),
        automaticallyImplyLeading: false,
        title: FontFormat(
          text: 'นโบายความเป็นส่วนตัว',
          weight: FontWeight.w600,
          textColor: greyColor,
          size: 20.sp,
        ),
      ),
      body: ScreenUtilInit(
        builder: (BuildContext context, Widget? child) {
          return Stack(
            children: [
              Padding(
                padding: EdgeInsets.fromLTRB(16.w, 0, 16.w, 75.w),
                child: SingleChildScrollView(
                  child: Column(
                    crossAxisAlignment: CrossAxisAlignment.start,
                    children: [
                      SizedBox(height: 16.w),
                      FontFormat(
                        text: 'บทนํา',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    บริษัท อัลปากา มีเดีย แอนด์ เทคโนโลยี โซลูชั่นส์ จำกัด (“SEED App” “เรา” หรือ “พวกเรา”) จะดำเนินการเก็บรวบรวมข้อมูลที่เกี่ยวข้องกับบุคคล (“ข้อมูลส่วนบุคคล”) เพื่อให้บริการแอปพลิเคชัน SEED (“SEED App”) รวมถึงการนำเสนอสินค้า แอปพลิเคชัน การบริการ และเว็บไซต์ที่เกี่ยวข้องกับ SEED App ทั้งหมด (ต่อไปนี้รวมเรียกว่า “บริการฯ”) เราตระหนักดีว่า การคุ้มครองข้อมูลส่วนบุคคลเป็นหนึ่งในประเด็นการจัดการที่สำคัญที่สุดในความรับผิดชอบของบริษัทในฐานะผู้ให้บริการเนื้อหาทางอินเทอร์เน็ต เราจะปฏิบัติตามกฎหมายและข้อบังคับที่บังคับใช้ในประเทศและภูมิภาคต่างๆ ซึ่งเราดำเนินธุรกิจอยู่ (กฎหมายและข้อบังคับดังกล่าวต่อไปนี้รวมเรียกว่า "กฎหมายที่มีผลใช้บังคับ") และจะพยายามคุ้มครองข้อมูลส่วนบุคคลอย่างเหมาะสมตามนโยบายความเป็นส่วนตัวฉบับนี้ (“นโยบายความเป็นส่วนตัว”)',
                      ),
                      FontFormat(
                        text:
                            '    “นโยบายความเป็นส่วนตัว” ฉบับนี้ อธิบายถึงประเภทของข้อมูลส่วนบุคคลที่เราทำการเก็บรวบรวม การใช้ การเปิดเผยข้อมูลส่วนบุคคล และวิธีการที่ท่านสามารถจัดการข้อมูลส่วนบุคคลของท่าน',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'ขอบเขตของนโยบายฉบับนี้',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    นโยบายความเป็นส่วนตัวฉบับนี้ใช้บังคับแก่ข้อมูลส่วนบุคคลทั้งหมดที่เก็บรวบรวมโดยบริการฯ ของเรา ทั้งนี้ โดยไม่คำนึงถึงประเทศหรือภูมิภาคที่เราให้บริการฯ',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'เป้าหมายของการให้บริการและผู้ให้บริการ',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text: '    นโยบายความเป็นส่วนตัวฉบับนี้ใช้บังคับกับข้อมูลส่วนบุคคลทั้งหมดที่เก็บรวบรวมจากการให้บริการฯ ของเรา',
                      ),
                      FontFormat(
                        text:
                            '    เราอาจมีการใช้นโยบายความเป็นส่วนตัวเฉพาะบุคคล หรือข้อกำหนดเพิ่มเติมในข้อกำหนดและเงื่อนไขการใช้งานหรือนโยบายความเป็นส่วนฉบับนี้ (ต่อไปนี้รวมเรียกว่า “นโยบายความเป็นส่วนตัวเฉพาะบุคคล”) กับการบริการเฉพาะ โดยนโยบายความเป็นส่วนตัวเฉพาะบุคคลจะอธิบายถึงประเภทของข้อมูลส่วนบุคลลที่เราเก็บรวบรวม การใช้ และการเปิดเผยข้อมูลส่วนบุคคลเพื่อการให้บริการเฉพาะดังกล่าว และนโยบายอื่นๆ ที่บังคับใช้กับบริการเฉพาะดังกล่าวด้วย ทั้งนี้ หากมีความไม่สอดคล้องกันระหว่างสาระสำคัญของนโยบายความเป็นส่วนตัวเฉพาะบุคคลและนโยบายความเป็นส่วนตัวฉบับนี้ ให้นโยบายความเป็นส่วนตัวเฉพาะบุคคลมีผลใช้บังคับ SEED เป็นผู้ควบคุมข้อมูลส่วนบุคคลในการประมวลข้อมูลส่วนบุคคลภายใต้นโยบายฉบับนี้ ของเรา',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'ข้อมูลส่วนบุคคลที่ทําการเก็บรวบรวม',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text: 'เราจะดำเนินการเก็บรวบรวมข้อมูล ดังต่อไปนี้',
                      ),
                      FontFormat(
                        text:
                            '    - ข้อมูลที่ท่านให้แก่เรา เช่น หมายเลขโทรศัพท์ของท่านที่ลงทะเบียนเมื่อสร้างบัญชี และข้อมูลโปรไฟล์ที่ท่านระบุไว้เมื่อใช้บริการฯ ของเรา',
                      ),
                      FontFormat(
                        text: '    - ข้อมูลที่เกี่ยวข้องกับสถานะการใช้บริการฯ ของเราที่ท่านเป็นผู้โพสต์และข้อมูลการเข้าสู่ระบบของท่าน',
                      ),
                      FontFormat(
                        text: '    - ข้อมูลสาธารณะที่ประกอบด้วยข้อมูลส่วนบุคคล เช่น ข่าวออนไลน์ที่เผยแพร่บนอินเทอร์เน็ต',
                      ),
                      FontFormat(
                        text:
                            '    - เราจะทำการเก็บรวบรวมข้อมูลส่วนบุคคลประเภทดังต่อไปนี้เพื่อประโยชน์ในการให้บริการฯ หากท่านไม่สามารถให้ข้อมูลบางประเภทที่จำเป็นต่อการลงทะเบียนเพื่อใช้บริการฯ เช่น หมายเลขโทรศัพท์ ท่านอาจไม่สามารถใช้บริการฯ ของเราได้ทั้งหมดหรือบางส่วน',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'ข้อมูลส่วนบุคคลที่อัปโหลดโดยผู้ใช้รายอื่น',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    เราอาจเก็บรวบรวมข้อมูลส่วนบุคคล กรณีผู้ใช้บางรายอัปโหลดข้อมูลที่ประกอบด้วยข้อมูลส่วนบุคคลในการใช้บริการฯ ของเรา เช่น ข้อมูลส่วนตัวที่ถูกรวบรวมมาในระบบ',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'วัตถุประสงค์ในการประมวลผล',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text: 'เราจะดำเนินการประมวลผลข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์ดังต่อไปนี้',
                      ),
                      FontFormat(
                        text: '    - เพื่อให้บริการและรักษาคุณภาพการให้บริการ',
                      ),
                      FontFormat(
                        text: '    - เพื่อพัฒนาและปรับปรุงบริการและเนื้อหาต่างๆ',
                      ),
                      FontFormat(
                        text: '    - เพื่อรักษาความปลอดภัยหรือป้องกันการเข้าถึงโดยไม่ได้รับอนุญาต และ/หรือ',
                      ),
                      FontFormat(
                        text: '    - เพื่อเสนอบริการที่ดีและเหมาะสมแก่ท่าน',
                      ),
                      FontFormat(
                        text:
                            'เราประมวลผลข้อมูลส่วนบุคคลเพื่อให้บริการฯ แก่ผู้ใช้บริการ เพื่อใช้ประโยชน์จากการสืบค้นและพัฒนาบริการให้ปลอดภัยและดียิ่งขึ้น และเพื่อให้บริการที่เชื่อมโยงไปยังผู้ใช้อย่างแท้จริง รวมถึงการโฆษณาต่างๆ เราจะไม่ประมวลผลข้อมูลส่วนบุคคลที่เราได้รับมานอกเหนือไปจากขอบเขตที่ระบุไว้ในวัตถุประสงค์การใช้ เว้นแต่จะอยู่ภายในขอบเขตที่ได้รับความยินยอมจากท่านหรือตามที่ได้รับอนุญาตจากกฎหมายที่มีผลใช้บังคับ นอกจากนี้ เราจะดำเนินการตามมาตรการที่เหมาะสมเพื่อให้มั่นใจได้ว่า ข้อมูลส่วนบุคคลของท่านจะไม่ถูกใช้เพื่อวัตถุประสงค์อื่นใด โดยเราจะประมวลผลข้อมูลของท่านดังนี้',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'ข้อมูลส่วนบุคคลที่อัปโหลดโดยผู้ใช้รายอื่น',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    เราอาจเก็บรวบรวมข้อมูลส่วนบุคคล กรณีผู้ใช้บางรายอัปโหลดข้อมูลที่ประกอบด้วยข้อมูลส่วนบุคคลในการใช้บริการฯ ของเรา เช่น ข้อมูลส่วนตัวที่ถูกรวบรวมมาในระบบ',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'การพัฒนาและปรับปรุงบริการและเนื้อหาต่างๆ',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    เราจะดำเนินการประมวลผลข้อมูลส่วนบุคคลเพื่อพัฒนาและปรับปรุงบริการฯ สินค้า และเนื้อหาให้ดียิ่งขึ้น เพื่อรองรับกับการใช้งานในอนาคต เราจะใช้ข้อมูลส่วนบุคคลเพื่อพัฒนาและปรับปรุงการให้บริการและเนื้อหา ตามตัวอย่างดังต่อไปนี้',
                      ),
                      FontFormat(
                        text: '    - เพื่อปรับปรุงการให้บริการฯ ของเราโดยการสร้างฐานข้อมูลเชิงสถิติ และโครงสร้างการใช้งานที่เกี่ยวกับบริการฯ',
                      ),
                      FontFormat(
                        text: '    - เพื่อพัฒนาบริการและเนื้อหาโดยอ้างอิงจากแนวโน้มของประวัติการเข้าร่วมกิจกรรม',
                      ),
                      FontFormat(
                        text: '    - เพื่อพัฒนาระบบการแสดงผลโดยการอ้างอิงจากการความถี่ในการใช้งาน tab ในแอปพลิเคชัน หรือ',
                      ),
                      FontFormat(
                        text: '    - เพื่อจัดทำแบบสำรวจที่เกี่ยวข้องกับบริการของเราทั้งบริการที่ให้บริการอยู่ในปัจจุบันหรืออาจให้บริการในอนาคต',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'เพื่อรักษาความปลอดภัยหรือป้องกันการเข้าถึงโดยไม่ได้รับอนุญาต',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    เราจะประมวลผลข้อมูลส่วนบุคคลและยกระดับการรักษาความปลอดภัย เพื่อป้องกันการใช้งานโดยไม่ได้รับอนุญาต เพื่อรักษาสภาพแวดล้อมของการใช้งานที่เหมาะสมอยู่ตลอดเวลา และเพื่อให้ผู้ใช้ทุกท่านสามารถใช้บริการได้อย่างปลอดภัยเราจะประมวลผลข้อมูลส่วนบุคคลเพื่อรักษาความปลอดภัยหรือป้องกันการเข้าถึงโดยไม่ได้รับอนุญาตในกรณีตามตัวอย่างดังต่อไปนี้',
                      ),
                      FontFormat(
                        text:
                            '    - เพื่อยืนยันว่ามีการละเมิดข้อกำหนดและเงื่อนไขการใช้งาน หรือการกระทำที่ไม่ชอบด้วยกฎหมาย หรือการเข้าถึงโดยไม่ชอบ หรือการใช้งานอื่นใดโดยไม่ได้รับอนุญาต',
                      ),
                      FontFormat(
                        text:
                            '    - เพื่อตรวจสอบและยืนยันรายละเอียดของรายงาน และการโพสต์ที่ไม่ชอบด้วยกฎหมาย หรือกรณีอื่นๆ รวมถึงเพื่อพัฒนาเครื่องมือสำหรับป้องกันการใช้งานโดยไม่ได้รับอนุญาตด้วยวิธีการต่างๆ เช่น วิเคราะห์รายละเอียดของรายงาน เป็นต้น หรือ',
                      ),
                      FontFormat(
                        text: '    - เพื่อยืนยันข้อเท็จจริงในกรณีที่อาจมีการใช้หรือการเข้าถึงโดยไม่ชอบเกิดขึ้น ',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'การเปิดเผยข้อมูลส่วนบุคคล',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    เราจะไม่เปิดเผย หรือแชร์ข้อมูลส่วนบุคคลกับบุคคลที่สามเว้นแต่เราจะได้รับความยินยอมจากท่าน หรือเป็นการปฏิบัติตามกฎหมายที่มีผลบังคับใช้ เมื่อเราได้รับความยินยอมจากท่าน หรือมีกฎหมายให้อำนาจไว้ เราอาจส่งหรือโอนข้อมูลส่วนบุคคลไปยังประเทศที่สามถึงแม้ว่าประเทศดังกล่าวจะไม่มีกฎหมายคุ้มครองข้อมูลส่วนบุคคลที่มีมาตรการการคุ้มครองข้อมูลส่วนบุคคลที่เทียบเท่ากับประเทศหรือภูมิภาคที่ท่านอาศัยอยู่ก็ตาม โดยทั่วไปแล้ว เราจะไม่เปิดเผย หรือแชร์ข้อมูลส่วนบุคคลกับบุคคลที่สามเว้นแต่เราจะได้รับความยินยอมจากท่าน หรือเป็นการปฏิบัติตามกฎหมายที่มีผลบังคับใช้ อย่างไรก็ตาม ในกรณีต่อไปนี้ เราอาจเปิดเผยข้อมูลส่วนบุคคลแก่บุคคลที่สามเพื่อประโยชน์ในการให้บริการฯและวิเคราะห์ข้อมูล',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'การควบคุมความปลอดภัยของข้อมูลส่วนบุคคล',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    เราจะใช้มาตรการรักษาความปลอดภัยทางเทคนิคที่เข้มงวดในการจัดการข้อมูลส่วนบุคคลที่เราทำการเก็บรวบรวม และเพื่อเป็นการปรับปรุงการคุ้มครองข้อมูลส่วนบุคคลของเราอย่างต่อเนื่อง เราจะพิจารณาทบทวนและแก้ไขเพิ่มเติมกฎระเบียบและข้อบังคับภายในของเราให้สอดคล้องกับการเปลี่ยนแปลงของกฎหมายและบรรทัดฐานทางสังคม เราจะเก็บรวบรวมข้อมูลส่วนใหญ่ของท่านไว้ เว้นแต่ท่านมีคำขอให้ลบบัญชีของท่าน เมื่อเราอนุญาตคำขอดังกล่าวแล้ว เราจะทำการเก็บรวบรวมข้อมูลดังกล่าวไว้ในช่วงเวลาที่กำหนดและจะดำเนินการลบข้อมูลของท่านตามกฎหมายที่มีผลใช้บังคับใช้และตามกฎเกณฑ์ภายในต่อไป',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'การใช้โมดูลและคุกกี้ของบุคคลที่สาม',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text: '    เราอาจใช้คุกกี้และ SDK ของบุคคลที่สามเพื่อบรรลุวัตถุประสงค์ที่อธิบายไว้ในนโยบายนี้',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'โมดูลของบุคคลที่สาม',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text: '    เราอาจทำการติดตั้งโมดูลของชุดพัฒนาซอฟต์แวร์ของบริษัทอื่น (SDK) ในบริการฯ ของเราเพื่อวัตถุประสงค์ดังต่อไปนี้:',
                      ),
                      FontFormat(
                        text: '    - เพื่อวิเคราะห์สถานะการใช้บริการฯ ของเรา และ',
                      ),
                      FontFormat(
                        text: '    - เพื่อเผยแพร่ข่าวสารและกิจกรรมในนามของเราและประเมินประสิทธิภาพของข่าวสารและกิจกรรมดังกล่าว',
                      ),
                      FontFormat(
                        text: '    - สำหรับข้อมูลส่วนบุคคลของท่านที่ประมวลผลโดยบุคคลที่สามผ่านโมดูลที่จัดหาโดยบุคคลที่สาม',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'คุกกี้และเครื่องมือวิเคราะห์อื่นๆ',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    คุกกี้คือไฟล์ข้อความขนาดเล็กที่เก็บไว้ในคอมพิวเตอร์ของท่านเมื่อเข้าเยี่ยมชมเว็บไซต์ และไฟล์ข้อความนี้จะเก็บข้อมูลที่ผู้ให้บริการเว็บไซต์ ซึ่งสามารถอ่านได้เมื่อเข้าเยี่ยมชมเว็บไซต์อีกครั้งในภายหลัง เราอาจใช้คุกกี้และเทคโนโลยีการติดตามเว็บไซต์ที่คล้ายกัน เพื่อวัตถุประสงค์ดังต่อไปนี้',
                      ),
                      FontFormat(
                        text:
                            '    - เพื่อจัดเก็บสถานะการเข้าสู่ระบบของท่าน รับรองความถูกต้องของผู้เยี่ยมชม รักษาเซสชัน และใช้มาตรการรักษาความปลอดภัยต่างๆ',
                      ),
                      FontFormat(
                        text: '    - เพื่อจัดเก็บ วันที่ เวลาล่าสุดในการเข้าถึง และปรับปรุงความเป็นมิตรกับผู้ใช้',
                      ),
                      FontFormat(
                        text: '    - เพื่อให้บริการที่ดีขึ้นโดยการทำความเข้าใจถึงจำนวนการเข้าถึงและโหมดการใช้งาน',
                      ),
                      FontFormat(
                        text: '    - เพื่อเผยแพร่กิจกรรมอละข่าวสารที่น่าสนใจสำหรับท่าน และ',
                      ),
                      FontFormat(
                        text: '    - เพื่อประเมินประสิทธิภาพของกิจกรรมและข่าวสาร',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'ข้อมูลที่เกี่ยวข้องกับการใช้งาน Google Analytics',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    เพื่อปรับปรุงบริการฯ ของเรา เราใช้ Google Analytics เพื่อวัดผลการบริการฯ เช่น เว็บไซต์ของเรา ทั้งนี้ Google อาจตั้งค่าคุกกี้หรืออ่านคุกกี้ที่มีอยู่เพื่อรวบรวมข้อมูล ในการนี้ข้อมูลต่างๆ เช่น URL ของเพจที่ท่านเข้าถึง และที่อยู่ IP จะถูกส่งไปยัง Google โดยอัตโนมัติ เราอาจใช้ข้อมูลดังกล่าวเพื่อทำความเข้าใจสถานะการใช้บริการฯ ของเรา หรือใช้ข้อมูลดังกล่าวในบริการฯ ของเรา สำหรับการประมวลผลข้อมูลโดย Google ใน Google Analytics ทั้งนี้ โปรดอ่านทำความเข้าใจข้อตกลงในการให้บริการของ Google Analytics และนโยบายความเป็นส่วนตัวของ Google เพื่อความเข้าใจอันดี',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'ข้อมูลสำคัญอื่นๆ',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    เราขอสงวนสิทธิในการแก้ไขนโยบายฉบับนี้ โดยนโยบายเวอร์ชันล่าสุดจะถูกโพสต์บนเว็บไซต์นี้เสมอ และเราขอแนะนำให้ท่านตรวจสอบเนื้อหาของนโยบายเวอร์ชันล่าสุดอย่างละเอียดรอบคอบ เมื่อเราทำการเปลี่ยนแปลงที่สำคัญใดๆ ต่อนโยบายฉบับนี้ เราจะดำเนินการแจ้งให้ท่านทราบด้วยวิธีการที่เหมาะสมต่อไป',
                      ),
                      SizedBox(height: 10.w),
                      FontFormat(
                        text: 'การแก้ไขเปลี่ยนแปลงนโยบายฉบับนี้',
                        weight: FontWeight.w600,
                        size: 14.w,
                      ),
                      FontFormat(
                        text:
                            '    เราอาจดำเนินการแก้ไขนโยบายนี้เป็นครั้งคราว และนโยบายความเป็นส่วนตัวเวอร์ชันล่าสุดจะถูกโพสต์บนเว็บไซต์นี้เสมอ เมื่อเราทำการเปลี่ยนแปลงที่สำคัญใดๆ ต่อนโยบายฉบับนี้เราจะดำเนินการแจ้งให้ท่านทราบผ่านทางบริการฯ ของเราหรือด้วยวิธีการอื่นๆ ที่เหมาะสม ทั้งนี้ เราขอแนะนำให้ท่านตรวจสอบเนื้อหาของนโยบายความเป็นส่วนตัวเวอร์ชันล่าสุดอย่างละเอียดรอบคอบด้วย',
                      ),
                      FontFormat(
                        text:
                            '    ในกรณีที่ท่านไม่เห็นด้วยกับการเปลี่ยนแปลงใดๆ และท่านไม่ต้องการใช้บริการฯ ของเราอีกต่อไป ท่านสามารถเลือกที่จะปิดบัญชีของท่านได้ ทั้งนี้ การใช้บริการฯ ของเราอย่างต่อเนื่องหลังจากที่เราได้แจ้งการเปลี่ยนแปลงแก้ไขนโยบายให้ท่านทราบให้ถือเสมือนว่าท่านยอมรับการเปลี่ยนแปลงและให้ความยินยอมต่อนโยบายฉบับแก้ไขนี้ อย่างไรก็ตามเราจะดำเนินการขอความยินยอมจากท่านเมื่อจำเป็นภายใต้กฎหมายที่มีผลใช้บังคับ',
                      ),
                    ],
                  ),
                ),
              ),
              BottomMenu(
                titleCallBack: 'ย้อนกลับ',
              ),
            ],
          );
        },
      ),
    );
  }
}
